Revit 2027 API
XYZ.Multiply Method
Multiplies this vector by the specified value and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Multiply(
	double value
)
Public Function Multiply (
	value As Double
) As XYZ
public:
XYZ^ Multiply(
	double value
)
member Multiply :
        value : float -> XYZ
Parameters
value Double
The value to multiply with this vector.
Return Value
XYZ
The multiplied vector.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the specified value is an infinite number.
Remarks
 The multiplied vector is obtained by multiplying each coordinate of this vector by the specified value.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace